In [28]:
import math

In [29]:
print(math.sqrt(25))

5.0

In [30]:
# pip install pandas
import pandas as pd

In [31]:
# Etape1 dans pandas: créer un dtaframe à partir d'une source de données (csv, excel, bd....)
df = pd.read_csv('data.csv')

df # dans jupyter notebook, le print n'est pas nécessaire

,id,date,first_name,last_name,email,gender,ip_address,country,price_paid,tax
0,1,03/28/2021,Marylin,Alders,malders0@shop-pro.jp,Male,160.119.8.119,Canada,$5.36,NaN
1,2,03/19/2021,Hinda,Harridge,hharridge1@gnu.org,Female,210.51.172.132,Canada,$8.32,NaN
2,3,03/17/2021,Erl,Kilminster,ekilminster2@etsy.com,Male,213.8.101.145,United States,$3.73,20.0
3,4,03/19/2021,Grata,Brantl,gbrantl3@umn.edu,Female,5.140.237.101,United States,$3.70,20.0
4,5,03/24/2021,Kanya,Beasant,kbeasant4@jigsy.com,Male,106.252.162.233,Morocco,$9.24,20.0
...,...,...,...,...,...,...,...,...,...,...
995,996,03/24/2021,Duff,Errigo,derrigorn@elpais.com,Female,193.84.247.144,France,$3.63,NaN
996,997,03/17/2021,Ame,Rastall,arastallro@toplist.cz,Female,188.219.12.109,NaN,$4.59,20.0
997,998,03/13/2021,Betty,Stickels,bstickelsrp@cloudflare.com,Male,199.80.60.87,United States,$7.54,20.0
998,999,03/17/2021,Paquito,Tesoe,ptesoerq@rakuten.co.jp,Male,0.183.63.11,United States,$5.81,NaN
999,1000,03/23/2021,Rochelle,Pringuer,rpringuerrr@house.gov,NaN,170.193.249.83,Canada,$8.01,20.0

In [32]:
# info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   int64
 1   date        1000 non-null   object
 2   first_name  1000 non-null   object
 3   last_name   1000 non-null   object
 4   email       1000 non-null   object
 5   gender      931 non-null    object
 6   ip_address  1000 non-null   object
 7   country     956 non-null    object
 8   price_paid  1000 non-null   object
 9   tax         654 non-null    float64
dtypes: float64(1), int64(1), object(8)
memory usage: 78.3+ KB

In [33]:
# describe()
df.describe()

                id    tax
count  1000.000000  654.0
mean    500.500000   20.0
std     288.819436    0.0
min       1.000000   20.0
25%     250.750000   20.0
50%     500.500000   20.0
75%     750.250000   20.0
max    1000.000000   20.0

In [34]:
df.columns

Index(['id', 'date', 'first_name', 'last_name', 'email', 'gender',
       'ip_address', 'country', 'price_paid', 'tax'],
      dtype='object')

In [35]:
df.index

RangeIndex(start=0, stop=1000, step=1)

In [36]:
df.dtypes # dans pandas: 2 types numériques: int et flaot et les autres sont des objets

id              int64
date           object
first_name     object
last_name      object
email          object
gender         object
ip_address     object
country        object
price_paid     object
tax           float64
dtype: object

In [37]:
df['email']

0            malders0@shop-pro.jp
1              hharridge1@gnu.org
2           ekilminster2@etsy.com
3                gbrantl3@umn.edu
4             kbeasant4@jigsy.com
                  ...
995          derrigorn@elpais.com
996         arastallro@toplist.cz
997    bstickelsrp@cloudflare.com
998        ptesoerq@rakuten.co.jp
999         rpringuerrr@house.gov
Name: email, Length: 1000, dtype: object

In [38]:
df[['id', 'email']]

       id                       email
0       1        malders0@shop-pro.jp
1       2          hharridge1@gnu.org
2       3       ekilminster2@etsy.com
3       4            gbrantl3@umn.edu
4       5         kbeasant4@jigsy.com
..    ...                         ...
995   996        derrigorn@elpais.com
996   997       arastallro@toplist.cz
997   998  bstickelsrp@cloudflare.com
998   999      ptesoerq@rakuten.co.jp
999  1000       rpringuerrr@house.gov

[1000 rows x 2 columns]

In [39]:
df['price_paid']

0      $5.36
1      $8.32
2      $3.73
3      $3.70
4      $9.24
       ...
995    $3.63
996    $4.59
997    $7.54
998    $5.81
999    $8.01
Name: price_paid, Length: 1000, dtype: object

In [40]:
# supprimer le symbôle $ dans la colonne price_paid
def remplacer(value):
    return value.replace('$','')

df['price_paid'] = df['price_paid'].apply(remplacer)
df['price_paid']

0      5.36
1      8.32
2      3.73
3      3.70
4      9.24
       ...
995    3.63
996    4.59
997    7.54
998    5.81
999    8.01
Name: price_paid, Length: 1000, dtype: object

In [41]:
# modifier le type d'une colonne
df['price_paid'] = df['price_paid'].astype(float)
df['price_paid']

0      5.36
1      8.32
2      3.73
3      3.70
4      9.24
       ...
995    3.63
996    4.59
997    7.54
998    5.81
999    8.01
Name: price_paid, Length: 1000, dtype: float64

In [42]:
df.dtypes

id              int64
date           object
first_name     object
last_name      object
email          object
gender         object
ip_address     object
country        object
price_paid    float64
tax           float64
dtype: object

In [43]:
df['price_paid'].sum()
df['price_paid'].min()
df['price_paid'].max()
df['price_paid'].mean()

np.float64(6.461930000000001)

In [45]:
condition = df['price_paid'] > 6
df[condition]

,id,date,first_name,last_name,email,gender,ip_address,country,price_paid,tax
1,2,03/19/2021,Hinda,Harridge,hharridge1@gnu.org,Female,210.51.172.132,Canada,8.32,NaN
4,5,03/24/2021,Kanya,Beasant,kbeasant4@jigsy.com,Male,106.252.162.233,Morocco,9.24,20.0
6,7,03/14/2021,Ava,Kencott,akencott6@phoca.cz,Female,118.251.45.43,Canada,6.29,NaN
9,10,03/23/2021,Guglielma,Gookes,ggookes9@amazon.co.uk,Male,169.100.6.0,France,9.05,NaN
16,17,03/27/2021,Eve,Allaway,eallawayg@ebay.co.uk,Female,184.107.59.156,United States,6.44,20.0
...,...,...,...,...,...,...,...,...,...,...
989,990,03/16/2021,Horatius,Van Arsdalen,hvanarsdalenrh@prlog.org,NaN,243.214.103.52,France,8.69,20.0
990,991,03/19/2021,Shep,Thorburn,sthorburnri@prnewswire.com,Male,108.123.252.15,France,7.02,20.0
992,993,03/04/2021,Maurene,Guilloneau,mguilloneaurk@about.me,Male,108.73.141.204,France,9.19,NaN
997,998,03/13/2021,Betty,Stickels,bstickelsrp@cloudflare.com,Male,199.80.60.87,United States,7.54,20.0
999,1000,03/23/2021,Rochelle,Pringuer,rpringuerrr@house.gov,NaN,170.193.249.83,Canada,8.01,20.0

In [46]:
df.groupby('country')['price_paid'].sum()

country
Canada           1017.45
France           2619.61
Morocco           362.97
United States    2183.67
Name: price_paid, dtype: float64

In [47]:
df.groupby('gender')['price_paid'].sum()

gender
Female    3165.26
Male      2833.61
Name: price_paid, dtype: float64

In [48]:
df.groupby(['gender', 'country'])['price_paid'].sum()

gender  country
Female  Canada            475.03
        France           1263.72
        Morocco           189.67
        United States    1094.31
Male    Canada            458.81
        France           1176.31
        Morocco           141.38
        United States     960.84
Name: price_paid, dtype: float64